import { ThemeConsumer } from 'styled-components';

import { Props } from './types';

const GraphIcon = ({ size = 50, ...props }: Props) => {
  return (
    <ThemeConsumer>
      {(theme) => (
        <svg
          {...props}
          xmlns="http://www.w3.org/2000/svg"
          id="gradiente_study_stats"
          width={size}
          height={size}
          viewBox="0 0 50 50"
        >
          <defs>
            <linearGradient
              id="linear-gradient"
              x1=".899"
              x2="-.297"
              y1=".516"
              y2=".464"
              gradientUnits="objectBoundingBox"
            >
              <stop offset="0" stop-color={theme.color.PRIMARY} />
              <stop offset="1" stop-color={theme.color.PRIMARYSUB} />
            </linearGradient>
            <linearGradient
              id="linear-gradient-2"
              x1=".369"
              x2=".896"
              y1=".792"
              y2="-.278"
              xlinkHref="#linear-gradient"
            />
          </defs>
          <path id="사각형_30723" fill="none" d="M0 0H50V50H0z" />
          <g id="그룹_38166" transform="translate(-122.562 -409.248)">
            <path
              id="패스_265238"
              d="M160.807 421.051a4.834 4.834 0 0 0-3.928 7.66l-6.069 7.585a4.788 4.788 0 0 0-3.113.113l-.918-.963a4.84 4.84 0 1 0-8.632.425l-8.2 10.522a1.853 1.853 0 0 0 1.172 2.967l.293.027a1.865 1.865 0 0 0 1.46-.714l8.2-10.522a4.758 4.758 0 0 0 3.015-.15l.907.953a4.839 4.839 0 1 0 8.682-.311l6.381-7.976a4.837 4.837 0 1 0 .745-9.617zm-18.45 14.4a1.967 1.967 0 1 1 1.966-1.967 1.967 1.967 0 0 1-1.965 1.971zm7.059 7.442a1.967 1.967 0 1 1 1.967-1.966 1.967 1.967 0 0 1-1.967 1.973zm11.391-15.038a1.967 1.967 0 1 1 1.967-1.967 1.967 1.967 0 0 1-1.967 1.97z"
              fill={theme.color.WHITE}
              transform="translate(0 -.428)"
            />
            <path
              id="패스_265239"
              d="M167.481 454.347a1.724 1.724 0 0 0-1.094-.615 1.922 1.922 0 0 0-.53-.01h-33.178l-1.428 2.947h34.617a2.067 2.067 0 0 0 .222.013 1.85 1.85 0 0 0 .965-.267 1.476 1.476 0 0 0 .7-.958 1.336 1.336 0 0 0-.274-1.11z"
              fill={theme.color.WHITE}
              transform="translate(-.335 -6.908)"
            />
            <path
              id="패스_265240"
              fill="url(#linear-gradient)"
              d="M167.481 454.347a1.724 1.724 0 0 0-1.094-.615 1.922 1.922 0 0 0-.53-.01h-33.178l-1.428 2.947h34.617a2.067 2.067 0 0 0 .222.013 1.85 1.85 0 0 0 .965-.267 1.476 1.476 0 0 0 .7-.958 1.336 1.336 0 0 0-.274-1.11z"
              transform="translate(-.335 -6.908)"
            />
            <path
              id="패스_265241"
              fill={theme.color.PRIMARY}
              d="M132.762 423.654v-3.08l-.011-.142a1.653 1.653 0 0 0-1.874-1.509 1.766 1.766 0 0 0-1.3 1.509v3.222h-.009v24.628a1.472 1.472 0 0 0 1.6 1.493 1.658 1.658 0 0 0 1.6-1.493v-1.492z"
            />
            <path
              id="패스_265242"
              fill="url(#linear-gradient-2)"
              d="M160.807 421.051a4.834 4.834 0 0 0-3.928 7.66l-6.069 7.585a4.788 4.788 0 0 0-3.113.113l-.918-.963a4.84 4.84 0 1 0-8.632.425l-8.2 10.522a1.853 1.853 0 0 0 1.172 2.967l.293.027c.566 0 .768.448 1.117 0l8.542-11.237a4.758 4.758 0 0 0 3.015-.15l.907.953a4.839 4.839 0 1 0 8.682-.311l6.381-7.976a4.837 4.837 0 1 0 .745-9.617zm-18.45 14.4a1.967 1.967 0 1 1 1.966-1.967 1.967 1.967 0 0 1-1.965 1.971zm7.059 7.442a1.967 1.967 0 1 1 1.967-1.966 1.967 1.967 0 0 1-1.967 1.973zm11.391-15.038a1.967 1.967 0 1 1 1.967-1.967 1.967 1.967 0 0 1-1.967 1.97z"
              transform="translate(0 -.428)"
            />
          </g>
        </svg>
      )}
    </ThemeConsumer>
  );
};

export default GraphIcon;
