import React from 'react';
import styled from 'styled-components';

import Modal, { ModalProps } from 'components/Modal';

const ScrollModal: React.FC<ModalProps> = ({ ...props }) => {
  return (
    <>
      <UpperDiv>
        맺어, 품었기 방황하였으며, 가지에 것은 창공에 동산에는 같으며, 사막이다.
        어디 이상의 구할 뜨고, 무엇을 속에서 설레는 이것이다. 사람은 속에 그것은
        피부가 없는 거선의 운다. 투명하되 부패를 이것을 옷을 대고, 따뜻한 뜨고,
        힘있다. 싶이 너의 그들은 만천하의 이성은 타오르고 트고, 말이다.
        튼튼하며, 찾아다녀도, 것이 용기가 용감하고 귀는 관현악이며, 피다. 사람은
        끓는 이상의 그들의 꽃이 주며, 스며들어 것이다. 굳세게 사람은 청춘의
        용기가 미묘한 광야에서 동력은 거친 맺어, 봄바람이다. 무엇을 인간의 어디
        힘차게 꾸며 것이다. 인생에 기쁘며, 날카로우나 같은 가치를 영락과 같이,
        인도하겠다는 속에 듣는다. 눈에 청춘의 풍부하게 과실이 것이다.
        <br />
        같은 구할 얼마나 튼튼하며, 그리하였는가? 별과 낙원을 튼튼하며, 구하기
        아니다. 아름답고 없으면 인간이 사랑의 대중을 그들에게 것이다. 얼마나
        옷을 웅대한 얼음이 힘있다. 하는 커다란 얼음과 황금시대다. 생명을 품었기
        가치를 있다. 희망의 그들을 이것은 꽃이 굳세게 사는가 것이다. 같지 새가
        맺어, 풍부하게 유소년에게서 새 따뜻한 내는 이상 듣는다. 역사를 끓는
        미묘한 새가 인도하겠다는 반짝이는 쓸쓸하랴?
        <br />
        희망의 바이며, 평화스러운 두손을 얼음이 뿐이다. 이상, 작고 기쁘며,
        실현에 장식하는 불어 위하여 그들을 같이, 사막이다. 있을 때까지 낙원을
        없으면 따뜻한 영락과 우리 전인 거선의 것이다. 그들의 위하여, 영락과
        낙원을 소담스러운 약동하다. 너의 목숨이 꽃이 몸이 인간이 철환하였는가?
        가치를 같으며, 찾아 앞이 있음으로써 심장은 우리 때까지 황금시대의
        약동하다. 그것은 그들은 생생하며, 밥을 인생에 것이다. 새 청춘의 보이는
        뛰노는 천지는 운다. 풍부하게 것은 피가 피부가 소금이라 긴지라 끓는
        사라지지 위하여서. 이상 인류의 청춘의 싹이 그들은 따뜻한 뜨고, 것이다.
        실로 더운지라 이상이 풍부하게 찾아 그리하였는가?
      </UpperDiv>
      <Modal {...props}>
        <ModalBody>
          맺어, 품었기 방황하였으며, 가지에 것은 창공에 동산에는 같으며,
          사막이다. 어디 이상의 구할 뜨고, 무엇을 속에서 설레는 이것이다. 사람은
          속에 그것은 피부가 없는 거선의 운다. 투명하되 부패를 이것을 옷을 대고,
          따뜻한 뜨고, 힘있다. 싶이 너의 그들은 만천하의 이성은 타오르고 트고,
          말이다. 튼튼하며, 찾아다녀도, 것이 용기가 용감하고 귀는 관현악이며,
          피다. 사람은 끓는 이상의 그들의 꽃이 주며, 스며들어 것이다. 굳세게
          사람은 청춘의 용기가 미묘한 광야에서 동력은 거친 맺어, 봄바람이다.
          무엇을 인간의 어디 힘차게 꾸며 것이다. 인생에 기쁘며, 날카로우나 같은
          가치를 영락과 같이, 인도하겠다는 속에 듣는다. 눈에 청춘의 풍부하게
          과실이 것이다.
          <br />
          같은 구할 얼마나 튼튼하며, 그리하였는가? 별과 낙원을 튼튼하며, 구하기
          아니다. 아름답고 없으면 인간이 사랑의 대중을 그들에게 것이다. 얼마나
          옷을 웅대한 얼음이 힘있다. 하는 커다란 얼음과 황금시대다. 생명을
          품었기 가치를 있다. 희망의 그들을 이것은 꽃이 굳세게 사는가 것이다.
          같지 새가 맺어, 풍부하게 유소년에게서 새 따뜻한 내는 이상 듣는다.
          역사를 끓는 미묘한 새가 인도하겠다는 반짝이는 쓸쓸하랴?
          <br />
          희망의 바이며, 평화스러운 두손을 얼음이 뿐이다. 이상, 작고 기쁘며,
          실현에 장식하는 불어 위하여 그들을 같이, 사막이다. 있을 때까지 낙원을
          없으면 따뜻한 영락과 우리 전인 거선의 것이다. 그들의 위하여, 영락과
          낙원을 소담스러운 약동하다. 너의 목숨이 꽃이 몸이 인간이 철환하였는가?
          가치를 같으며, 찾아 앞이 있음으로써 심장은 우리 때까지 황금시대의
          약동하다. 그것은 그들은 생생하며, 밥을 인생에 것이다. 새 청춘의 보이는
          뛰노는 천지는 운다. 풍부하게 것은 피가 피부가 소금이라 긴지라 끓는
          사라지지 위하여서. 이상 인류의 청춘의 싹이 그들은 따뜻한 뜨고, 것이다.
          실로 더운지라 이상이 풍부하게 찾아 그리하였는가?
          <br />
          맺어, 품었기 방황하였으며, 가지에 것은 창공에 동산에는 같으며,
          사막이다. 어디 이상의 구할 뜨고, 무엇을 속에서 설레는 이것이다. 사람은
          속에 그것은 피부가 없는 거선의 운다. 투명하되 부패를 이것을 옷을 대고,
          따뜻한 뜨고, 힘있다. 싶이 너의 그들은 만천하의 이성은 타오르고 트고,
          말이다. 튼튼하며, 찾아다녀도, 것이 용기가 용감하고 귀는 관현악이며,
          피다. 사람은 끓는 이상의 그들의 꽃이 주며, 스며들어 것이다. 굳세게
          사람은 청춘의 용기가 미묘한 광야에서 동력은 거친 맺어, 봄바람이다.
          무엇을 인간의 어디 힘차게 꾸며 것이다. 인생에 기쁘며, 날카로우나 같은
          가치를 영락과 같이, 인도하겠다는 속에 듣는다. 눈에 청춘의 풍부하게
          과실이 것이다.
          <br />
          같은 구할 얼마나 튼튼하며, 그리하였는가? 별과 낙원을 튼튼하며, 구하기
          아니다. 아름답고 없으면 인간이 사랑의 대중을 그들에게 것이다. 얼마나
          옷을 웅대한 얼음이 힘있다. 하는 커다란 얼음과 황금시대다. 생명을
          품었기 가치를 있다. 희망의 그들을 이것은 꽃이 굳세게 사는가 것이다.
          같지 새가 맺어, 풍부하게 유소년에게서 새 따뜻한 내는 이상 듣는다.
          역사를 끓는 미묘한 새가 인도하겠다는 반짝이는 쓸쓸하랴? 희망의 바이며,
          평화스러운 두손을 얼음이 뿐이다. 이상, 작고 기쁘며, 실현에 장식하는
          불어 위하여 그들을 같이, 사막이다. 있을 때까지 낙원을 없으면 따뜻한
          영락과 우리 전인 거선의 것이다. 그들의 위하여, 영락과 낙원을
          소담스러운 약동하다. 너의 목숨이 꽃이 몸이 인간이 철환하였는가? 가치를
          같으며, 찾아 앞이 있음으로써 심장은 우리 때까지 황금시대의 약동하다.
          그것은 그들은 생생하며, 밥을 인생에 것이다. 새 청춘의 보이는 뛰노는
          천지는 운다. 풍부하게 것은 피가 피부가 소금이라 긴지라 끓는 사라지지
          위하여서. 이상 인류의 청춘의 싹이 그들은 따뜻한 뜨고, 것이다. 실로
          더운지라 이상이 풍부하게 찾아 그리하였는가?
          <br />
          맺어, 품었기 방황하였으며, 가지에 것은 창공에 동산에는 같으며,
          사막이다. 어디 이상의 구할 뜨고, 무엇을 속에서 설레는 이것이다. 사람은
          속에 그것은 피부가 없는 거선의 운다. 투명하되 부패를 이것을 옷을 대고,
          따뜻한 뜨고, 힘있다. 싶이 너의 그들은 만천하의 이성은 타오르고 트고,
          말이다. 튼튼하며, 찾아다녀도, 것이 용기가 용감하고 귀는 관현악이며,
          피다. 사람은 끓는 이상의 그들의 꽃이 주며, 스며들어 것이다. 굳세게
          사람은 청춘의 용기가 미묘한 광야에서 동력은 거친 맺어, 봄바람이다.
          무엇을 인간의 어디 힘차게 꾸며 것이다. 인생에 기쁘며, 날카로우나 같은
          가치를 영락과 같이, 인도하겠다는 속에 듣는다. 눈에 청춘의 풍부하게
          과실이 것이다.
          <br />
          같은 구할 얼마나 튼튼하며, 그리하였는가? 별과 낙원을 튼튼하며, 구하기
          아니다. 아름답고 없으면 인간이 사랑의 대중을 그들에게 것이다. 얼마나
          옷을 웅대한 얼음이 힘있다. 하는 커다란 얼음과 황금시대다. 생명을
          품었기 가치를 있다. 희망의 그들을 이것은 꽃이 굳세게 사는가 것이다.
          같지 새가 맺어, 풍부하게 유소년에게서 새 따뜻한 내는 이상 듣는다.
          역사를 끓는 미묘한 새가 인도하겠다는 반짝이는 쓸쓸하랴?
          <br />
          희망의 바이며, 평화스러운 두손을 얼음이 뿐이다. 이상, 작고 기쁘며,
          실현에 장식하는 불어 위하여 그들을 같이, 사막이다. 있을 때까지 낙원을
          없으면 따뜻한 영락과 우리 전인 거선의 것이다. 그들의 위하여, 영락과
          낙원을 소담스러운 약동하다. 너의 목숨이 꽃이 몸이 인간이 철환하였는가?
          가치를 같으며, 찾아 앞이 있음으로써 심장은 우리 때까지 황금시대의
          약동하다. 그것은 그들은 생생하며, 밥을 인생에 것이다. 새 청춘의 보이는
          뛰노는 천지는 운다. 풍부하게 것은 피가 피부가 소금이라 긴지라 끓는
          사라지지 위하여서. 이상 인류의 청춘의 싹이 그들은 따뜻한 뜨고, 것이다.
          실로 더운지라 이상이 풍부하게 찾아 그리하였는가?
        </ModalBody>
      </Modal>
    </>
  );
};

export default ScrollModal;

const UpperDiv = styled.div`
  height: 500px;
  width: 100%;
  border: 1px solid ${(props) => props.theme.color.SECONDARY};
  overflow: scroll;
  padding: 50px;
  line-height: 25px;
`;

const ModalBody = styled.div`
  background-color: #fff;
  border-radius: 13px;
  width: 500px;
  height: 350px;
  overflow: scroll;
  padding: 20px;
  line-height: 25px;
  z-index: 999;

  > p {
    :nth-of-type(1) {
      font-weight: bold;
      color: ${(props) => props.theme.color.PRIMARY};
    }
    :nth-of-type(2) {
      text-align: center;
      color: ${(props) => props.theme.color.GRAY5};
    }
  }
`;
